PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p16f18857.inc
;----- WPUC Bits -----------------------------------------------------
WPUC0            EQU  H'0000'
WPUC1            EQU  H'0001'
WPUC2            EQU  H'0002'
WPUC3            EQU  H'0003'
WPUC4            EQU  H'0004'
WPUC5            EQU  H'0005'
WPUC6            EQU  H'0006'
WPUC7            EQU  H'0007'


;----- ODCONC Bits -----------------------------------------------------
ODCC0            EQU  H'0000'
ODCC1            EQU  H'0001'
ODCC2            EQU  H'0002'
ODCC3            EQU  H'0003'
ODCC4            EQU  H'0004'
ODCC5            EQU  H'0005'
ODCC6            EQU  H'0006'
ODCC7            EQU  H'0007'


;----- SLRCONC Bits -----------------------------------------------------
SLRC0            EQU  H'0000'
SLRC1            EQU  H'0001'
SLRC2            EQU  H'0002'
SLRC3            EQU  H'0003'
SLRC4            EQU  H'0004'
SLRC5            EQU  H'0005'
SLRC6            EQU  H'0006'
SLRC7            EQU  H'0007'


;----- INLVLC Bits -----------------------------------------------------
INLVLC0          EQU  H'0000'
INLVLC1          EQU  H'0001'
INLVLC2          EQU  H'0002'
INLVLC3          EQU  H'0003'
INLVLC4          EQU  H'0004'
INLVLC5          EQU  H'0005'
INLVLC6          EQU  H'0006'
INLVLC7          EQU  H'0007'


;----- IOCCP Bits -----------------------------------------------------
IOCCP0           EQU  H'0000'
IOCCP1           EQU  H'0001'
IOCCP2           EQU  H'0002'
IOCCP3           EQU  H'0003'
IOCCP4           EQU  H'0004'
IOCCP5           EQU  H'0005'
IOCCP6           EQU  H'0006'
IOCCP7           EQU  H'0007'


;----- IOCCN Bits -----------------------------------------------------
IOCCN0           EQU  H'0000'
IOCCN1           EQU  H'0001'
IOCCN2           EQU  H'0002'
IOCCN3           EQU  H'0003'
IOCCN4           EQU  H'0004'
IOCCN5           EQU  H'0005'
IOCCN6           EQU  H'0006'
IOCCN7           EQU  H'0007'


;----- IOCCF Bits -----------------------------------------------------
IOCCF0           EQU  H'0000'
IOCCF1           EQU  H'0001'
IOCCF2           EQU  H'0002'
IOCCF3           EQU  H'0003'
IOCCF4           EQU  H'0004'
IOCCF5           EQU  H'0005'
IOCCF6           EQU  H'0006'
IOCCF7           EQU  H'0007'


;----- CCDNC Bits -----------------------------------------------------
CCDNC0           EQU  H'0000'
CCDNC1           EQU  H'0001'
CCDNC2           EQU  H'0002'
CCDNC3           EQU  H'0003'
CCDNC4           EQU  H'0004'
CCDNC5           EQU  H'0005'
CCDNC6           EQU  H'0006'
CCDNC7           EQU  H'0007'


;----- CCDPC Bits -----------------------------------------------------
CCDPC0           EQU  H'0000'
CCDPC1           EQU  H'0001'
CCDPC2           EQU  H'0002'
CCDPC3           EQU  H'0003'
CCDPC4           EQU  H'0004'
CCDPC5           EQU  H'0005'
CCDPC6           EQU  H'0006'
CCDPC7           EQU  H'0007'


;----- WPUE Bits -----------------------------------------------------
WPUE0            EQU  H'0000'
WPUE1            EQU  H'0001'
WPUE2            EQU  H'0002'


;----- INLVLE Bits -----------------------------------------------------
INLVLE0          EQU  H'0000'
INLVLE1          EQU  H'0001'
INLVLE2          EQU  H'0002'


;----- IOCEP Bits -----------------------------------------------------
IOCEP3           EQU  H'0003'


;----- IOCEN Bits -----------------------------------------------------
IOCEN3           EQU  H'0003'


;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- STATUS_SHAD Bits -----------------------------------------------------
C_SHAD           EQU  H'0000'
DC_SHAD          EQU  H'0001'
Z_SHAD           EQU  H'0002'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'1FFF'
       __BADRAM  H'000F'
       __BADRAM  H'0014'-H'0015'
       __BADRAM  H'0019'-H'001A'
       __BADRAM  H'001B'
       __BADRAM  H'0092'
       __BADRAM  H'009F'
       __BADRAM  H'0118'
       __BADRAM  H'0193'
       __BADRAM  H'0194'
       __BADRAM  H'0195'
       __BADRAM  H'019D'
       __BADRAM  H'019E'
       __BADRAM  H'019F'
       __BADRAM  H'029E'
       __BADRAM  H'029F'
       __BADRAM  H'038F'
       __BADRAM  H'0393'
       __BADRAM  H'0394'
       __BADRAM  H'0395'
       __BADRAM  H'0396'
       __BADRAM  H'0397'
       __BADRAM  H'0398'
       __BADRAM  H'0399'
       __BADRAM  H'039A'
       __BADRAM  H'039B'
       __BADRAM  H'039C'
       __BADRAM  H'039D'
       __BADRAM  H'039E'
       __BADRAM  H'039F'
       __BADRAM  H'0412'
       __BADRAM  H'0413'
       __BADRAM  H'0414'
       __BADRAM  H'0415'
       __BADRAM  H'049E'
       __BADRAM  H'049F'
       __BADRAM  H'051E'
       __BADRAM  H'051F'
       __BADRAM  H'0594'
       __BADRAM  H'0595'
       __BADRAM  H'0596'
       __BADRAM  H'0597'
       __BADRAM  H'0598'
       __BADRAM  H'0599'
       __BADRAM  H'059A'
       __BADRAM  H'059B'
       __BADRAM  H'059C'
       __BADRAM  H'059D'
       __BADRAM  H'059E'
       __BADRAM  H'059F'
       __BADRAM  H'0615'
       __BADRAM  H'061F'
       __BADRAM  H'0695'
       __BADRAM  H'0696'
       __BADRAM  H'0697'
       __BADRAM  H'0698'
       __BADRAM  H'0699'
       __BADRAM  H'069A'
       __BADRAM  H'069B'
       __BADRAM  H'069C'
       __BADRAM  H'069D'
       __BADRAM  H'069E'
       __BADRAM  H'069F'
       __BADRAM  H'0715'
       __BADRAM  H'071F'
       __BADRAM  H'078C'-H'0795'
       __BADRAM  H'079C'
       __BADRAM  H'079D'
       __BADRAM  H'079E'
       __BADRAM  H'079F'
       __BADRAM  H'0815'-H'0819'
       __BADRAM  H'0894'
       __BADRAM  H'089C'-H'089F'
       __BADRAM  H'090D'
       __BADRAM  H'0910'-H'0913'
       __BADRAM  H'0914'-H'091E'
       __BADRAM  H'098C'-H'098E'
       __BADRAM  H'0998'-H'099F'
       __BADRAM  H'0A0C'-H'0A1F'
       __BADRAM  H'0A8C'-H'0A9F'
       __BADRAM  H'0B0C'-H'0B1F'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0D0C'-H'0D1F'
       __BADRAM  H'0D8C'-H'0D9F'
       __BADRAM  H'0E0C'-H'0E0E'
       __BADRAM  H'0E0F'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E8E'
       __BADRAM  H'0E8F'-H'0E90'
       __BADRAM  H'0E91'-H'0E93'
       __BADRAM  H'0E94'-H'0E97'
       __BADRAM  H'0E98'-H'0E9B'
       __BADRAM  H'0E9C'-H'0E9E'
       __BADRAM  H'0E9F'
       __BADRAM  H'0F0C'-H'0F0F'
       __BADRAM  H'0F10'-H'0F1F'
       __BADRAM  H'0F8C'-H'0F98'
       __BADRAM  H'0F99'-H'0F9C'
       __BADRAM  H'0F9D'-H'0F9F'
       __BADRAM  H'100C'-H'101F'
       __BADRAM  H'108C'-H'109F'
       __BADRAM  H'110C'-H'111F'
       __BADRAM  H'118C'-H'119F'
       __BADRAM  H'120C'-H'121F'
       __BADRAM  H'128C'-H'129F'
       __BADRAM  H'130C'-H'131F'
       __BADRAM  H'138C'-H'139F'
       __BADRAM  H'140C'-H'141F'
       __BADRAM  H'148C'-H'149F'
       __BADRAM  H'150C'-H'151F'
       __BADRAM  H'158C'-H'159F'
       __BADRAM  H'160C'-H'161F'
       __BADRAM  H'168C'-H'169F'
       __BADRAM  H'170C'-H'171F'
       __BADRAM  H'178C'-H'179F'
       __BADRAM  H'180C'-H'181F'
       __BADRAM  H'188C'-H'189F'
       __BADRAM  H'190C'-H'191F'
       __BADRAM  H'198C'-H'199F'
       __BADRAM  H'19A0'-H'19EF'
       __BADRAM  H'1A0C'-H'1A1F'
       __BADRAM  H'1A20'-H'1A6F'
       __BADRAM  H'1A8C'-H'1A9F'
       __BADRAM  H'1AA0'-H'1AEF'
       __BADRAM  H'1B0C'-H'1B1F'
       __BADRAM  H'1B20'-H'1B6F'
       __BADRAM  H'1B8C'-H'1B9F'
       __BADRAM  H'1BA0'-H'1BEF'
       __BADRAM  H'1C0C'-H'1C1F'
       __BADRAM  H'1C20'-H'1C6F'
       __BADRAM  H'1C8C'-H'1C9F'
       __BADRAM  H'1CA0'-H'1CEF'
       __BADRAM  H'1D0C'-H'1D1F'
       __BADRAM  H'1D20'-H'1D6F'
       __BADRAM  H'1D8C'-H'1D9F'
       __BADRAM  H'1DA0'-H'1DEF'
       __BADRAM  H'1E0C'-H'1E0E'
       __BADRAM  H'1E38'-H'1E6F'
       __BADRAM  H'1E8C'-H'1E8E'
       __BADRAM  H'1E98'-H'1E9B'
       __BADRAM  H'1E9F'-H'1EA0'
       __BADRAM  H'1EA6'-H'1EA8'
       __BADRAM  H'1EAD'-H'1EB0'
       __BADRAM  H'1EB4'-H'1EB7'
       __BADRAM  H'1EBF'-H'1EC2'
       __BADRAM  H'1EC4'
       __BADRAM  H'1ECD'-H'1ECF'
       __BADRAM  H'1ED0'-H'1EDF'
       __BADRAM  H'1EE0'-H'1EEF'
       __BADRAM  H'1F0C'-H'1F0F'
       __BADRAM  H'1F28'-H'1F37'
       __BADRAM  H'1F42'
       __BADRAM  H'1F4D'
       __BADRAM  H'1F58'-H'1F64'
       __BADRAM  H'1F66'-H'1F67'
       __BADRAM  H'1F6C'-H'1F6F'
       __BADRAM  H'1F8C'
       __BADRAM  H'1F8D'-H'1F8F'
       __BADRAM  H'1F90'-H'1FAF'
       __BADRAM  H'1FB0'-H'1FCF'
       __BADRAM  H'1FD0'-H'1FD2'
       __BADRAM  H'1FD3'-H'1FD6'
       __BADRAM  H'1FD7'-H'1FE3'
       __BADRAM  H'1FEC'

